# Challenge 3

In this challenge we will work on the `Orders.csv` data set in the previous [Subsetting and Descriptive Stats lab](../../lab-subsetting-and-descriptive-stats/your-code/main.ipynb). In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

# Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders.csv` from the "subsetting" lab folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [3]:
# enter your code here
o = pd.read_csv("../../lab-subsetting-and-descriptive-stats/your-code/Orders.csv")
o.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [4]:
o.shape

(397924, 14)

In [5]:
o.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [20]:
# just need this info
o = o[['CustomerID', 'Country', 'amount_spent']]
o.head()

   CustomerID         Country  amount_spent
0       17850  United Kingdom         15.30
1       17850  United Kingdom         20.34
2       17850  United Kingdom         22.00
3       17850  United Kingdom         20.34
4       17850  United Kingdom         20.34

In [23]:
o.pivot_table(index=['CustomerID']).head() #amount spent for unique customers

            amount_spent
CustomerID
12346       77183.600000
12347          23.681319
12348          57.975484
12349          24.076027
12350          19.670588

In [25]:
def csq(quantile):
    return o.pivot_table(index=['CustomerID']).quantile(quantile)

In [36]:
quantiles = [csq(i/20) for i in range(0,20)]        #ammount spend per quantile
quantiles

[amount_spent    0.0
 Name: 0.0, dtype: float64, amount_spent    4.521875
 Name: 0.05, dtype: float64, amount_spent    5.968078
 Name: 0.1, dtype: float64, amount_spent    7.551524
 Name: 0.15, dtype: float64, amount_spent    9.635705
 Name: 0.2, dtype: float64, amount_spent    12.353054
 Name: 0.25, dtype: float64, amount_spent    14.308606
 Name: 0.3, dtype: float64, amount_spent    15.360444
 Name: 0.35, dtype: float64, amount_spent    16.207238
 Name: 0.4, dtype: float64, amount_spent    16.937118
 Name: 0.45, dtype: float64, amount_spent    17.716923
 Name: 0.5, dtype: float64, amount_spent    18.691743
 Name: 0.55, dtype: float64, amount_spent    19.588711
 Name: 0.6, dtype: float64, amount_spent    20.788179
 Name: 0.65, dtype: float64, amount_spent    22.450261
 Name: 0.7, dtype: float64, amount_spent    24.84841
 Name: 0.75, dtype: float64, amount_spent    28.528328
 Name: 0.8, dtype: float64, amount_spent    34.716647
 Name: 0.85, dtype: float64, amount_spent    50.6335
 Name: 0.9, dtype: float64, amount_spent    93.664566
 Name: 0.95, dtype: float64]

In [68]:
#lets say:

#VIP: 90th quantile => 93.66
VIP = 93.664566
#Prefered: 70th quantile => 24.84
Preferred = 24.84841

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

# Q2: How to identify which country has the most VIP Customers?

# Q3: How to identify which country has the most VIP+Preferred Customers combined?

Provide your solution for Q2 below:

In [69]:
# your code here
o.head()

   CustomerID         Country  amount_spent
0       17850  United Kingdom         15.30
1       17850  United Kingdom         20.34
2       17850  United Kingdom         22.00
3       17850  United Kingdom         20.34
4       17850  United Kingdom         20.34

In [70]:
pref = o[o['amount_spent']>=Preferred]

In [71]:
VIP = o[o['amount_spent']>=VIP]

In [72]:
VIP.pivot_table(index=['Country'], aggfunc=({'CustomerID':len})).sort_values('CustomerID', ascending=False).head()

#Most VIP

                CustomerID
Country
United Kingdom        9070
Netherlands           1153
EIRE                   486
Australia              451
Germany                254

In [74]:
pref.pivot_table(index=['Country'], aggfunc=({'CustomerID':len})).sort_values('CustomerID', ascending=False).head()

#Most pref and VIP

                CustomerID
Country
United Kingdom       54258
Germany               2194
EIRE                  2136
France                2033
Netherlands           1865